docs: updated readme
